app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT * FROM "articles" ORDER BY articles.id DESC LIMIT 1