app/controllers/articles_controller.rb

  def index
    @perpage = CPDConf.article_perp

    @page = (params[:page] || '1').to_i;
    @total = Article.count

    @dir = 'desc'
    @dir = 'asc' if params[:dir] == 'asc'

    @order = 'created_at'
    @order = 'leet' if params[:order] == 'leet'
    @order = 'lame' if params[:order] == 'lame'
    @order = 'hits' if params[:order] == 'hits'
    @order = 'title' if params[:order] == 'title'

    @articles = Article.find(:all, :order => (@order + " " + @dir), :limit => @perpage, :offset => (@page - 1) * @perpage);
---
SELECT count(*) AS count_all FROM "articles"
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def show
    @article = Article.find( params[:id] )

    @article.hits = @article.hits + 1
    @article.save
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
UPDATE "articles" SET "updated_at" = '2013-09-14 12:06:08', "views" = 1 WHERE "id" = 1

  def create
    # @article = Article.new

    # @article.title = params[:article][:title]
    # @article.abstract = params[:article][:abstract]
    # @article.body = params[:article][:body]

    @article = Article.new( validate_params )

    u = User.get_current_user session

    if u then # and u.id == @article.user_id then
      @article.user_id = u.id
      @article.icon = params[:article][:icon] || 0
      @article.save
---
INSERT INTO "articles" ("abstract", "leet", "updated_at", "created_at", "body", "lame", "title", "user_id", "hits") VALUES('pain', 0, '2013-09-15 06:14:47', '2013-09-15 06:14:47', 'Why so serious son?', 0, 'Joker', 2, 0)

  def update
    @article = Article.find( params[:id] )

    u = User.get_current_user session

    if u and (u.id == @article.user_id || u.priv == 10) then
      @article.update_attributes( validate_params )
---
SELECT * FROM "articles" WHERE ("articles"."id" = 8)
UPDATE "articles" SET "updated_at" = '2013-09-15 07:36:49', "body" = 'Why so serious son?<br>Why so serious son?<br>Why so serious son?<br>' WHERE "id" = 2