app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "user_id", "body", "created_at", "updated_at") VALUES(1, 2, 'cool man!', '2013-09-14 11:43:45', '2013-09-14 11:43:45')
---
  def create
    u = User.get_current_user session
    if u then
      @comment = Comment.new( validate_comment )

      @comment.article_id = params[:article_id]
      @comment.user_id = u.id

      @comment.save