app/controllers/tags_controller.rb

  def index
    @tags = Tag.all
---
SELECT * FROM "tags"

  def show
    @tag = Tag.find( params[:id] )
    @total = @tag.articles.count

    @perpage = CPDConf.tag_perp
    @page = (params[:page] || '1').to_i;

    @articles = @tag.articles.find(:all, :order => "created_at desc", :limit => @perpage, :offset => (@page - 1) * @perpage);
---
SELECT * FROM "tags" WHERE ("tags"."id" = 1)
SELECT "articles".* FROM "articles" INNER JOIN "taggings" ON "articles".id = "taggings".article_id WHERE (("taggings".tag_id = 1))