app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."username" = 'punkbot') LIMIT 1
SELECT * FROM "users" WHERE ("users"."email" = '') LIMIT 1
SELECT * FROM "users" WHERE ("users"."nickname" = 'punkbot') LIMIT 1
INSERT INTO "users" ("nickname", "email", "password", "username", "session_id", "created_at", "updated_at") VALUES('_null_', 'sinahatef.cpp@gmail.com', '9f86d081884c7d659a2feaa0c55ad015a3bf4f1b2b0b822cd15d6c15b0f00a08', '_null_', '56f1d0bad05df739919d928924555eb7', '2013-09-14 12:12:23', '2013-09-14 12:12:23')
---
  def goblack
	orig_captcha = session[:captcha]
    session.delete(:captcha)

    if orig_captcha == params[:captcha] then
      vname = User.find(:first, :conditions => {:username => params[:user][:username]}).nil?
      vmail = User.find(:first, :conditions => {:email => params[:user][:email]}).nil?
      vnick = User.find(:first, :conditions => {:nickname => params[:user][:nickname]}).nil?

      if vname and vmail and vnick then
        @user = User.new

        @user.username = params[:user][:username]
        @user.password = Digest::SHA256.hexdigest(params[:user][:password])
        @user.email = params[:user][:email]
        @user.nickname = params[:user][:nickname]
        @user.session_id = session[:session_id]
        @user.save

SELECT * FROM "users" WHERE ("users"."username" = '_null_') LIMIT 1
UPDATE "users" SET "password" = ']Æı«®ˆQÁÑ0‹Ï:l∂£r≤', "session_id" = '56f1d0bad05df739919d928924555eb7', "updated_at" = '2013-09-14 09:34:30' WHERE "id" = 1
---
  def authenticate
    @user = User.find(:first,
                      :conditions =>
                      { :username => params[:user][:username] }
                      )
    if @user and @user.password == Digest::SHA256.hexdigest(params[:user][:password]) then
      @user.session_id = session[:session_id]
      @user.save

SELECT * FROM "users" WHERE ("users"."session_id" = 'session_id')
---
  def logout
    @users = User.find(:all ,:conditions => {:session_id => session[:session_id]})