app/controllers/votes_controller.rb

SELECT * FROM "articles" WHERE ("articles"."id" = 2)
SELECT * FROM "votes" WHERE ("votes"."user_id" = 2 AND "votes"."article_id" = '2') LIMIT 1
UPDATE "articles" SET "updated_at" = '2013-09-15 06:58:13', "lame" = 1, "leet" = 0 WHERE "id" = 2
UPDATE "votes" SET "updated_at" = '2013-09-15 06:52:45', "score" = -1 WHERE "id" = 2
---
  def edit
    uid = User.get_current_user session

    if not uid then
      redirect_to_index_error
      return
    end

    aid = params[:article_id]

    scr = 0
    scr = 1 if params[:score] == '1337'
    scr = -1 if params[:score] == 'lame'

    @article = Article.find( aid )

    if @article and scr != 0 then
      vote = Vote.find(:first, :conditions => {:article_id => aid, :user_id => uid} )

      # if user voted before
      if vote then
        if vote.score == -1 then
          @article.lame = @article.lame - 1
        else
          @article.leet = @article.leet - 1
        end

        vote.score = scr
        vote.save

INSERT INTO "votes" ("score", "article_id", "updated_at", "created_at", "user_id") VALUES(-1, '3', '2013-09-15 10:53:39', '2013-09-15 10:53:39', 2)
---
      else
      # if it's a new vote
        vote = Vote.new({:article_id => aid, :user_id => uid, :score => scr})
        vote.save